Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.ZoneWithoutSpacesWarn Property
 This zone has no spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZoneWithoutSpacesWarn { get; }
Public Shared ReadOnly Property ZoneWithoutSpacesWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZoneWithoutSpacesWarn {
	FailureDefinitionId^ get ();
}
static member ZoneWithoutSpacesWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace